Revit 2027 API
BuiltInFailures.SketchFailures.CannotHaveArcs Property
 Sorry, we can't use arcs here.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotHaveArcs { get; }
Public Shared ReadOnly Property CannotHaveArcs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotHaveArcs {
	FailureDefinitionId^ get ();
}
static member CannotHaveArcs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace